**About Book Crossing Dataset**<br>

This dataset has been compiled by Cai-Nicolas Ziegler in 2004, and it comprises of three tables for users, books and ratings. Explicit ratings are expressed on a scale from 1-10 (higher values denoting higher appreciation) and implicit rating is expressed by 0.

Reference: http://www2.informatik.uni-freiburg.de/~cziegler/BX/

**Objective**

This project entails building a Book Recommender System for users based on user-based and item-based collaborative filtering approaches.

#### Execute the below cell to load the datasets

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pylab as plt
import seaborn as sns
%matplotlib inline

In [3]:
import warnings
warnings.filterwarnings('ignore')

In [4]:
#Loading data
books = pd.read_csv("books.csv", sep=";", error_bad_lines=False, encoding="latin-1")
books.columns = ['ISBN', 'bookTitle', 'bookAuthor', 'yearOfPublication', 'publisher', 'imageUrlS', 'imageUrlM', 'imageUrlL']

users = pd.read_csv('users.csv', sep=';', error_bad_lines=False, encoding="latin-1")
users.columns = ['userID', 'Location', 'Age']

ratings = pd.read_csv('ratings.csv', sep=';', error_bad_lines=False, encoding="latin-1")
ratings.columns = ['userID', 'ISBN', 'bookRating']

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'

### Check no.of records and features given in each dataset

In [5]:
books.shape
books.dtypes
books.describe().transpose()

(271360, 8)

ISBN                 object
bookTitle            object
bookAuthor           object
yearOfPublication    object
publisher            object
imageUrlS            object
imageUrlM            object
imageUrlL            object
dtype: object

,count,unique,top,freq
ISBN,271360,271360,0805021272,1
bookTitle,271360,242135,Selected Poems,27
bookAuthor,271359,102023,Agatha Christie,632
yearOfPublication,271360,202,2002,13903
publisher,271358,16807,Harlequin,7535
imageUrlS,271360,271044,http://images.amazon.com/images/P/067166218X.0...,2
imageUrlM,271360,271044,http://images.amazon.com/images/P/044020562X.0...,2
imageUrlL,271357,271041,http://images.amazon.com/images/P/003049186X.0...,2

In [6]:
users.shape
users.dtypes
users.describe().transpose()

(278858, 3)

userID        int64
Location     object
Age         float64
dtype: object

,count,mean,std,min,25%,50%,75%,max
userID,278858.0,139429.500000,80499.515020,1.0,69715.25,139429.5,209143.75,278858.0
Age,168096.0,34.751434,14.428097,0.0,24.00,32.0,44.00,244.0

In [7]:
ratings.shape
ratings.dtypes
ratings.describe().transpose()

(1149780, 3)

userID         int64
ISBN          object
bookRating     int64
dtype: object

,count,mean,std,min,25%,50%,75%,max
userID,1149780.0,140386.395126,80562.277718,2.0,70345.0,141010.0,211028.0,278854.0
bookRating,1149780.0,2.866950,3.854184,0.0,0.0,0.0,7.0,10.0

## Exploring books dataset

In [8]:
books.head()
books.tail()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,imageUrlS,imageUrlM,imageUrlL
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,imageUrlS,imageUrlM,imageUrlL
271355,0440400988,There's a Bat in Bunk Five,Paula Danziger,1988,Random House Childrens Pub (Mm),http://images.amazon.com/images/P/0440400988.0...,http://images.amazon.com/images/P/0440400988.0...,http://images.amazon.com/images/P/0440400988.0...
271356,0525447644,From One to One Hundred,Teri Sloat,1991,Dutton Books,http://images.amazon.com/images/P/0525447644.0...,http://images.amazon.com/images/P/0525447644.0...,http://images.amazon.com/images/P/0525447644.0...
271357,006008667X,Lily Dale : The True Story of the Town that Ta...,Christine Wicker,2004,HarperSanFrancisco,http://images.amazon.com/images/P/006008667X.0...,http://images.amazon.com/images/P/006008667X.0...,http://images.amazon.com/images/P/006008667X.0...
271358,0192126040,Republic (World's Classics),Plato,1996,Oxford University Press,http://images.amazon.com/images/P/0192126040.0...,http://images.amazon.com/images/P/0192126040.0...,http://images.amazon.com/images/P/0192126040.0...
271359,0767409752,A Guided Tour of Rene Descartes' Meditations o...,Christopher Biffle,2000,McGraw-Hill Humanities/Social Sciences/Languages,http://images.amazon.com/images/P/0767409752.0...,http://images.amazon.com/images/P/0767409752.0...,http://images.amazon.com/images/P/0767409752.0...

### Drop last three columns containing image URLs which will not be required for analysis

In [9]:
books = books.iloc[:, :-3]

In [10]:
books.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

**yearOfPublication**

### Check unique values of yearOfPublication

In [11]:
books.yearOfPublication.unique()
books['yearOfPublication'].nunique()
books['yearOfPublication'].count()
books['yearOfPublication'].value_counts()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984, 0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, '2000', '1995', '1999', '2004',
       '2003', '1990', '1994', '1986', '1989', '2002', '1981', '1993',
       '1983', '1982', '1976', '1991', '1977', '1998', '1992', '1996',
       '0', '1997', '2001', '1974', '1968', '1987', '1984', '1988',
       '1963', '1956', '1970', '1985', '1978', '1973', '1980', '1979',
       '1975', '1969', '1961', '1965', '1939', '1958', '1950', '1953',
       '1966', '1971', '1959', '1972', '1955', '1957', '1945', '1960',
       '1967', '1932', '1924', '1964', '2012', '1911', '1927', '1948',
       '1962', '2006', '1952', '1940', '1951', '1931', '1954', '2005',
       '1930', '1941', '1944', 'DK Publishing Inc', '1943', '1938',
       '1900', '1942', '1923', '1920', '1933', 'Gallimard', '1909',
       '1946', '2008', '1378', '2030', '1936', '1947', '2011', '2020',
       '1919', '1949', '1922', '1897', '2024', '1376', '1926', '2037'],
      dtype=object)

202

271360

2002         13903
2001         13715
1999         13414
2000         13373
1998         12116
2003         11610
1997         11494
1996         10687
1995         10259
1994          8857
1993          7920
1992          7390
1991          6926
1990          6394
1989          5825
1988          5545
1987          4761
2004          4629
1986          4258
1999          4017
1985          3912
2000          3859
2002          3724
1998          3650
2001          3644
1984          3631
0             3570
1997          3396
1996          3343
1983          3297
             ...
1900             1
2020             1
1924             1
1927             1
1904             1
1906             1
1908             1
1910             1
1926             1
1914             1
1917             1
2026             1
2038             1
2011             1
2021             1
Gallimard        1
1938             1
2024             1
2037             1
1934             1
1930             1
2008             1
1378             1
1931             1
1376             1
1927             1
1926             1
1944             1
1924             1
1897             1
Name: yearOfPublication, Length: 202, dtype: int64

As it can be seen from above that there are some incorrect entries in this field. It looks like Publisher names 'DK Publishing Inc' and 'Gallimard' have been incorrectly loaded as yearOfPublication in dataset due to some errors in csv file.


Also some of the entries are strings and same years have been entered as numbers in some places. We will try to fix these things in the coming questions.

### Check the rows having 'DK Publishing Inc' as yearOfPublication

In [12]:
print("count of DK Publishing Inc", len(books[books['yearOfPublication'] == 'DK Publishing Inc']))

count of DK Publishing Inc 2

### Drop the rows having `'DK Publishing Inc'` and `'Gallimard'` as `yearOfPublication`

In [13]:
books = books[books['yearOfPublication'] != 'DK Publishing Inc']
books = books[books['yearOfPublication'] != 'Gallimard']
books.shape

(271357, 5)

### Change the datatype of yearOfPublication to 'int'

In [14]:
books['yearOfPublication'] = books['yearOfPublication'].astype(int)

In [15]:
books.dtypes

ISBN                 object
bookTitle            object
bookAuthor           object
yearOfPublication     int32
publisher            object
dtype: object

### Drop NaNs in `'publisher'` column

In [16]:
books.dropna(subset=['publisher'], inplace=True)

In [17]:
books['publisher'].isnull().any()
books['publisher'].isnull().sum()

False

0

## Exploring Users dataset

In [18]:
print(users.shape)
users.head()

(278858, 3)

   userID                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

In [19]:
users.info()
users.dtypes
users.describe().transpose()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 3 columns):
userID      278858 non-null int64
Location    278858 non-null object
Age         168096 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 6.4+ MB

userID        int64
Location     object
Age         float64
dtype: object

,count,mean,std,min,25%,50%,75%,max
userID,278858.0,139429.500000,80499.515020,1.0,69715.25,139429.5,209143.75,278858.0
Age,168096.0,34.751434,14.428097,0.0,24.00,32.0,44.00,244.0

### Get all unique values in ascending order for column `Age`

In [20]:
unique_ages = users['Age'].unique()
np.sort(unique_ages, axis=-1, kind='quicksort', order=None)

array([  0.,   1.,   2.,   3.,   4.,   5.,   6.,   7.,   8.,   9.,  10.,
        11.,  12.,  13.,  14.,  15.,  16.,  17.,  18.,  19.,  20.,  21.,
        22.,  23.,  24.,  25.,  26.,  27.,  28.,  29.,  30.,  31.,  32.,
        33.,  34.,  35.,  36.,  37.,  38.,  39.,  40.,  41.,  42.,  43.,
        44.,  45.,  46.,  47.,  48.,  49.,  50.,  51.,  52.,  53.,  54.,
        55.,  56.,  57.,  58.,  59.,  60.,  61.,  62.,  63.,  64.,  65.,
        66.,  67.,  68.,  69.,  70.,  71.,  72.,  73.,  74.,  75.,  76.,
        77.,  78.,  79.,  80.,  81.,  82.,  83.,  84.,  85.,  86.,  87.,
        88.,  89.,  90.,  91.,  92.,  93.,  94.,  95.,  96.,  97.,  98.,
        99., 100., 101., 102., 103., 104., 105., 106., 107., 108., 109.,
       110., 111., 113., 114., 115., 116., 118., 119., 123., 124., 127.,
       128., 132., 133., 136., 137., 138., 140., 141., 143., 146., 147.,
       148., 151., 152., 156., 157., 159., 162., 168., 172., 175., 183.,
       186., 189., 199., 200., 201., 204., 207., 208., 209., 210., 212.,
       219., 220., 223., 226., 228., 229., 230., 231., 237., 239., 244.,
        nan])

Age column has some invalid entries like nan, 0 and very high values like 100 and above

### Values below 5 and above 90 do not make much sense for our book rating case...hence replace these by NaNs

In [21]:
len(users[users.Age < 5])
len(users[users.Age > 90])

882

430

In [22]:
users.loc[users['Age'] < 5, 'Age'] = np.nan
users.loc[users['Age'] > 90, 'Age'] = np.nan

In [23]:
len(users[users.Age < 5])
len(users[users.Age > 90])

0

0

### Replace null values in column `Age` with mean

In [24]:
users['Age'].replace(np.nan, users['Age'].mean(), inplace=True)

### Change the datatype of `Age` to `int`

In [25]:
users['Age'] = users['Age'].astype(int)
users.dtypes

userID       int64
Location    object
Age          int32
dtype: object

## Exploring the Ratings Dataset

### check the shape

In [26]:
ratings.shape
ratings.dtypes
ratings.describe().transpose()

(1149780, 3)

userID         int64
ISBN          object
bookRating     int64
dtype: object

,count,mean,std,min,25%,50%,75%,max
userID,1149780.0,140386.395126,80562.277718,2.0,70345.0,141010.0,211028.0,278854.0
bookRating,1149780.0,2.866950,3.854184,0.0,0.0,0.0,7.0,10.0

In [27]:
n_users = users.shape[0]
n_books = books.shape[0]
n_users
n_books

278858

271355

In [28]:
ratings.head(5)

   userID        ISBN  bookRating
0  276725  034545104X           0
1  276726  0155061224           5
2  276727  0446520802           0
3  276729  052165615X           3
4  276729  0521795028           6

### Ratings dataset should have books only which exist in our books dataset. Drop the remaining rows

In [29]:
ratings['bookRating'].value_counts()

0     716109
8     103736
10     78610
7      76457
9      67541
5      50974
6      36924
4       8904
3       5996
2       2759
1       1770
Name: bookRating, dtype: int64

In [30]:
ratings =   ratings[ratings.ISBN.isin(books.ISBN)]
ratings.shape

(1031130, 3)

In [31]:
ratings['bookRating'].value_counts()

0     647291
8      91804
10     71225
7      66401
9      60776
5      45355
6      31687
4       7617
3       5118
2       2375
1       1481
Name: bookRating, dtype: int64

### Consider only ratings from 1-10 and leave 0s in column `bookRating`

In [32]:
ratings = ratings[ratings.bookRating > 0]
ratings.shape

(383839, 3)

### Find out which rating has been given highest number of times

In [33]:
ratings['bookRating'].value_counts()

8     91804
10    71225
7     66401
9     60776
5     45355
6     31687
4      7617
3      5118
2      2375
1      1481
Name: bookRating, dtype: int64

### **Collaborative Filtering Based Recommendation Systems**

### For more accurate results only consider users who have rated atleast 100 books

In [34]:
ratings = ratings.groupby('userID').filter(lambda x: len(x) >= 100)
ratings.head()

      userID        ISBN  bookRating
1456  277427  002542730X          10
1458  277427  003008685X           8
1461  277427  0060006641          10
1465  277427  0060542128           7
1474  277427  0061009059           9

### Generating ratings matrix from explicit ratings

#### Note: since NaNs cannot be handled by training algorithms, replace these by 0, which indicates absence of ratings

In [35]:
ratings.isna().sum()

userID        0
ISBN          0
bookRating    0
dtype: int64

In [36]:
from sklearn.model_selection import train_test_split

In [37]:
trainDF, tempDF = train_test_split(ratings, test_size=0.2, random_state=100)
#creating a copy of tempDF as testDF
testDF = tempDF.copy()
#Assigning ratings of tempDF to nan
tempDF.rating = np.nan

In [38]:
testDF = testDF.dropna()
testDF.head()

        userID        ISBN  bookRating
733900  177432  0192835947           6
273626   63714  3829060114           9
173342   37644  0590457225           7
363370   87555  0141000198           8
224143   52350  2203001143           9

In [39]:
ratings = pd.concat([trainDF, tempDF]).reset_index()
ratings.shape
ratings.head()

(103269, 4)

    index  userID        ISBN  bookRating
0  695529  169682  0553580337           8
1  426444  101851  0890878234          10
2   48772   11676  0385474016          10
3  284111   67840  019285304X          10
4  410090   98391  0756400503           9

In [40]:
R_df = ratings.pivot(index = 'userID', columns ='ISBN', values = 'bookRating').fillna(0)
R_df.tail()

ISBN,0000913154,0001046438,000104687X,0001047213,0001047973,000104799X,0001048082,0001053736,0001053744,0001055607,...,B000092Q0A,B00009EF82,B00009NDAN,B0000DYXID,B0000T6KHI,B0000VZEJQ,B0000X8HIE,B00013AX9E,B0001I1KOG,B000234N3A
userID,,,,,,,,,,,,,,,,,,,,,
274061,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
274301,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,10.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
275970,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
277427,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
278418,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

### Generate the predicted ratings using SVD with no.of singular values to be 50

In [41]:
from scipy.sparse.linalg import svds
#singluar value decomposition
#Compute the largest k singular values/vectors for a sparse matrix.
#k: Number of singular values and vectors to compute. Must be 1 <= k < min(R_df.shape)
# R_df is to compute the SVD on
# The singular values - sigma
U, sigma, Vt = svds(R_df, k = 50)

In [42]:
sigma = np.diag(sigma)
sigma

array([[147.92121613,   0.        ,   0.        , ...,   0.        ,
          0.        ,   0.        ],
       [  0.        , 149.3438051 ,   0.        , ...,   0.        ,
          0.        ,   0.        ],
       [  0.        ,   0.        , 150.07400599, ...,   0.        ,
          0.        ,   0.        ],
       ...,
       [  0.        ,   0.        ,   0.        , ..., 379.58327277,
          0.        ,   0.        ],
       [  0.        ,   0.        ,   0.        , ...,   0.        ,
        634.72875357,   0.        ],
       [  0.        ,   0.        ,   0.        , ...,   0.        ,
          0.        , 680.30978318]])

In [43]:
predicted_ratings = np.dot(np.dot(U, sigma), Vt) 
preds_df = pd.DataFrame(predicted_ratings, columns = R_df.columns)

### Lets find the recommendations for user with id `2110`

#### Note: Execute the below cells to get the variables loaded

In [44]:
userID = 2110

In [45]:
user_id = 2 #2nd row in ratings matrix and predicted matrix

In [46]:
ratings_2ndrow = ratings.iloc[0:1,:]
ratings_2ndrow

    index  userID        ISBN  bookRating
0  695529  169682  0553580337           8

### Get the predicted ratings for userID `2110` and sort them in descending order

In [47]:
ratings = ratings[ratings['userID']==userID]
ratings.sort_values('bookRating',ascending=False,inplace=True)
ratings

       index  userID        ISBN  bookRating
863    14463    2110  0345317580          10
74612  14466    2110  0345362276          10
43895  14507    2110  0439222303          10
45804  14571    2110  0671751174          10
49337  14524    2110  0486270718          10
2560   14606    2110  1565111575          10
56994  14461    2110  0345307674          10
62498  14568    2110  0671695304          10
65854  14593    2110  0812505042          10
68826  14552    2110  0590629794          10
74284  14457    2110  0345260627          10
75195  14608    2110  1570420564          10
37940  14508    2110  0439240700          10
76160  14459    2110  0345283929          10
77737  14548    2110  059046678X          10
84519  14458    2110  0345283554          10
85113  14602    2110  097089726x          10
85135  14460    2110  034528710X          10
86226  14537    2110  059035342X          10
86569  14503    2110  0394843509          10
90939  14496    2110  0380570009          10
96639  14536    2110  0590213040          10
38366  14464    2110  0345335287          10
56771  14535    2110  0590109960          10
18847  14534    2110  0590109715          10
20358  14550    2110  0590629778          10
14717  14551    2110  0590629786          10
20972  14566    2110  067166865X          10
4037   14576    2110  0679805265          10
21967  14450    2110  0140022651          10
...      ...     ...         ...         ...
69107  14452    2110  0142302163           8
88738  14500    2110  0394553284           7
71561  14498    2110  038513097x           7
24821  14556    2110  0590880780           7
24796  14475    2110  0373619472           7
31115  14486    2110  037364292X           7
8470   14601    2110  093317490X           7
99835  14448    2110  0060987529           7
23490  14477    2110  0373619502           7
83972  14564    2110  0671529714           7
24896  14605    2110  1561008931           7
79760  14501    2110  0394563131           7
55879  14485    2110  0373642911           7
58811  14586    2110  0786807555           7
53797  14472    2110  0373614896           7
20361  14549    2110  059047054X           7
73218  14476    2110  0373619499           7
27114  14591    2110  0806512318           6
31319  14483    2110  0373642857           6
81698  14512    2110  0440920221           6
30806  14468    2110  0345423038           6
78933  14482    2110  0373642849           6
35191  14471    2110  0373614845           6
74463  14555    2110  0590880748           6
94678  14609    2110  1572970944           6
83158  14473    2110  037361490X           5
31726  14528    2110  0515134384           5
60291  14453    2110  0151008116           5
66710  14529    2110  0515136557           3
45181  14578    2110  0688047211           1

[103 rows x 4 columns]

### Create a dataframe with name `user_data` containing userID `2110` explicitly interacted books

In [48]:
user_data = ratings

In [49]:
user_data.head()

       index  userID        ISBN  bookRating
863    14463    2110  0345317580          10
74612  14466    2110  0345362276          10
43895  14507    2110  0439222303          10
45804  14571    2110  0671751174          10
49337  14524    2110  0486270718          10

In [50]:
user_data.shape

(103, 4)

### Combine the user_data and and corresponding book data(`book_data`) in a single dataframe with name `user_full_info`

In [51]:
book_data = books[books.ISBN.isin(user_data.ISBN)]

In [52]:
book_data.shape

(103, 5)

In [53]:
book_data.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
246,0151008116,Life of Pi,Yann Martel,2002,Harcourt
904,015216250X,So You Want to Be a Wizard: The First Book in ...,Diane Duane,2001,Magic Carpet Books
1000,0064472779,All-American Girl,Meg Cabot,2003,HarperTrophy
1302,0345307674,Return of the Jedi (Star Wars),James Kahn,1983,Del Rey Books
1472,0671527215,Hitchhikers's Guide to the Galaxy,Douglas Adams,1984,Pocket

In [54]:
user_test = pd.merge(user_data, book_data, on='ISBN', how='outer')

In [55]:
user_full_info = pd.merge(user_data, book_data, on='ISBN', how='outer')
user_full_info = user_full_info.drop('index',axis=1)

In [56]:
user_full_info.head()

,userID,ISBN,bookRating,bookTitle,bookAuthor,yearOfPublication,publisher
0,2110,0345317580,10,Magic Kingdom for Sale - Sold! (Magic Kingdom ...,Terry Brooks,1990,Del Rey Books
1,2110,0345362276,10,Wizard at Large (Rookies Series),Terry Brooks,1989,Del Rey Books
2,2110,0439222303,10,"Poof! Rabbits Everywhere! (Abracadabra!, 1)",Peter Lerangis,2002,Little Apple
3,2110,0671751174,10,First Evil (Fear Street Cheerleaders 1) : Firs...,R.L. Stine,1992,Simon Pulse
4,2110,0486270718,10,The Invisible Man (Dover Thrift Editions),H. G. Wells,1992,Dover Publications

In [57]:
user_full_info.shape

(103, 7)

### Get top 10 recommendations for above given userID from the books not already rated by that user

In [58]:
user_full_info.head(10)

,userID,ISBN,bookRating,bookTitle,bookAuthor,yearOfPublication,publisher
0,2110,0345317580,10,Magic Kingdom for Sale - Sold! (Magic Kingdom ...,Terry Brooks,1990,Del Rey Books
1,2110,0345362276,10,Wizard at Large (Rookies Series),Terry Brooks,1989,Del Rey Books
2,2110,0439222303,10,"Poof! Rabbits Everywhere! (Abracadabra!, 1)",Peter Lerangis,2002,Little Apple
3,2110,0671751174,10,First Evil (Fear Street Cheerleaders 1) : Firs...,R.L. Stine,1992,Simon Pulse
4,2110,0486270718,10,The Invisible Man (Dover Thrift Editions),H. G. Wells,1992,Dover Publications
5,2110,1565111575,10,Return of the Jedi: The Original Radio Drama,Anthony Daniels,1996,Highbridge Audio
6,2110,0345307674,10,Return of the Jedi (Star Wars),James Kahn,1983,Del Rey Books
7,2110,0671695304,10,"FOREVER : A Novel of Good and Evil, Love and Hope",Judy Blume,1989,Pocket
8,2110,0812505042,10,The Time Machine,H. G. Wells,1995,Tor Books
9,2110,0590629794,10,"The Encounter (Animorphs , No 3)",K. A. Applegate,1996,Scholastic